# Задаем векторы параметров a, b, c и x
a <- c(4.2, -0.35, 2.8)
b <- c(5.3, 1.8, -0.6)
c <- c(1.5, -1.8, 2.0)
x <- c(3.5, 2.5, 1.5)

# Создаем пустой вектор для хранения значений y
y <- c()

# Для каждого набора параметров вычисляем значение y по формуле
for (i in 1:3) {
  # Вычисляем значение e^(a + b)
  eab <- exp(a[i] + b[i])

  # Вычисляем значение e^x
  ex <- exp(x[i])

  # Сравниваем значения eab и ex
  if (eab > ex) {
    # Если eab больше ex, то y равно sin(eab) + x^2
    y[i] <- sin(eab) + x[i]^2
  } else if (eab == ex) {
    # Если eab равно ex, то y равно arctan(abc) + x^(1/3)
    y[i] <- atan(a[i] * b[i] * c[i]) + x[i]^(1/3)
  } else {
    # Если eab меньше ex, то y равно cos(sqrt(abs(x + abc)))
    y[i] <- cos(sqrt(abs(x[i] + a[i] * b[i] * c[i])))
  }
}

# Выводим вектор y на экран
print(y)
